Tekla Open API Reference for Tekla Structures 2025
RebarPropertyModifier.AffectsWholeBarPlane Property
 Gets or sets a value indicating whether the modifier affects all bars in the plane or just those that it touches.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AffectsWholeBarPlane { get; set; }
Public Property AffectsWholeBarPlane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RebarPropertyModifier Class
Tekla.Structures.Model Namespace